---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.StairsRunJustification.RightExterior
enum: Autodesk.Revit.DB.Architecture.StairsRunJustification
source: html/4d75bda7-267b-dc0e-286a-b5efb839655f.htm
---
# Autodesk.Revit.DB.Architecture.StairsRunJustification.RightExterior

The creation path for the run is the right stringer exterior edge.